#+TITLE: GTD ツールとしての Org mode
#+LANGUAGE: ja
#+AUTHOR: 島野 善雄
#+EMAIL: shimano.yoshio@jp.fujitsu.com
#+OPTIONS: author:t prop:nil <:nil H:7
#+OPTIONS: toc:4 creator:nil timestamp:nil email:t  todo:nil pri:nil tags:nil
#+DESCRIPTION: LaTeX Tips
#+KEYWORDS:  Org-mode GTD
#+EXCLUDE_TAGS: noexport
#+STARTUP: indent


# 図目次の出力
#+LATEX: \listoffigures
#+TOC: figure
# 表目次の出力
#+TOC: tables 

# HTML Setting
#+INFOJS_OPT: view:showall
# #+INCLUDE: "~/Org/Templates/setup/theme-bigblow.setup" 
#+INCLUDE: "~/Org/Templates/setup/theme-readtheorg.setup" 

# ドキュメントクラスの指定
#+LATEX_CLASS: jsbook
# ドキュメントクラスのオプションの指定
#+LATEX_CLASS_OPTIONS: [a4j,12pt,openany,uplatex]
# カスタムスタイルの読み込み
#+LATEX_HEADER: \usepackage{shimano}

# ファイルのバージョン
#+LATEX_HEADER: \FileVerjou{1.0}

# tcolorbox でのプログラムリスト出力
# #+LATEX: \tcblistof[\chapter*]{box}{プログラムリスト}

# 本文はじまり
#+LATEX: \mainmatter


** Org-mode のすすめ                                           :RefileTarget:
:PROPERTIES:
:ID:       516226cf-cebb-40e1-949f-426a572c2a73
:END:
:CLOCK:
CLOCK: [2013-03-22 金 13:50]--[2013-03-22 金 14:06] =>  0:16
CLOCK: [2013-02-07 木 11:05]--[2013-02-07 木 11:09] =>  0:04
CLOCK: [2013-01-31 木 14:54]--[2013-01-31 木 14:58] =>  0:04
CLOCK: [2012-04-12 木 13:17]--[2012-04-12 木 13:22] =>  0:05
:END:

みなさんはタスク管理ツールは何を使っていますか?
紙の手帳ですか? Outlook ですか? 私は Org-mode をお勧めします。


 - Org mode の何が良いのか?
   - TODO をコンテキストの中で管理することができる.
   - 様々なフォーマットでにエクスポートすることができる
   - ドキュメントの中でプログラムを実行することができる
     - ドキュメントの中で Ruby や Python などのプログラムを実行して、ドキュメントの中に挿入することができます。
     - Jupyter や Mathematica のノートのようです。
 - Org mode でできること
   - Todo 管理
   - プロジェクト管理
     - 私はプロジェクト管理とタスク管理は同じツールを使うのだと思っていましたが、
       一般的には
   - ドキュメントの内部でプログラムを書き、それを実行すること
     - 例えば、ドキュメントの中で試験仕様書を書き、かつ、それを実行し、報告書としてまとめることができます。



*** Yasnippet を使って Org mode のスニペットを作る                  :@Home:
:PROPERTIES:
:LOCATION: Home
:Added:    [2019-01-11 金 09:18]
:ID:       8fde7482-1de3-4f6e-950e-67778c5094a5
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2019-01-11 金 13:14]
:END:
:CLOCK:
CLOCK: [2019-01-11 金 14:56]--[2019-01-11 金 17:20] =>  2:24
CLOCK: [2019-01-11 金 12:41]--[2019-01-11 金 13:14] =>  0:33
CLOCK: [2019-01-11 金 09:18]--[2019-01-11 金 09:19] =>  0:01
:END:

- [[http://keisanbutsuriya.hateblo.jp/entry/2015/12/12/181028][Emacsでyasnippetを使う - 計算物理屋の研究備忘録]]


Spacemacs では設定済みでした。



*** 見出しの折り畳み
:PROPERTIES:
:ID:       a127e9e7-2a65-45bf-9b72-541e01c43914
:END:
:CLOCK:
- State "DONE"       from "NEXT"       [2013-03-05 火 15:20]
CLOCK: [2013-03-05 火 15:16]--[2013-03-05 火 15:20] =>  0:04
:END:

見出しはアウトラインの階層構造を作ります.

このアウトラインを TAB キーと S-TAB キーを使って、 折り畳んだり(隠したり), 拡げたりすることができます.

Org-mode の見出しの中での移動コマンド一覧です。

- =C-c C-n=, =outline-next-visible-heading= :: 次の見出し.
- =C-c C-p=, =outline-previous-visible-heading= :: 前の見出し.
- =C-c C-f=, =org-forward-same-level= :: 同じレベルの次の見出し.
- =C-c C-b=, =org-backward-same-level= :: 同じレベルの前の見出し.
- =C-c C-u=, =outline-up-heading= :: 逆向きに, より高い見出し.
- =C-c C-j=, =org-goto= :: 現在のアウトラインの可視性を変更することなく, 異なる場所にジャンプします.
   一時的バッファの中にドキュメント構造を表示し, そこで
   目的地を見つけるために次のキーを使うことができます:

*** Org-mode の表の中の編集コマンド一覧
:PROPERTIES:
:ID:       d2d979fb-9134-454b-8a8d-3de141d59f32
:END:
:LOGBOOK:
- State "TODO"       from "DONE"       [2016-09-05 Mon 15:43]
:END:
:CLOCK:
- State "DONE"       from "NEXT"       [2013-03-05 火 15:16]
CLOCK: [2013-03-05 火 15:11]--[2013-03-05 火 15:16] =>  0:05
:END:

- =M-left=,=M-right=, =org-table-move-column-left=,  =org-table-move-column-right= ::
  現在の列を左/右に移動します.
- =M-S-left=, =org-table-delete-column= :: 現在の列をキルします.
- =M-S-right=, =org-table-insert-column= :: カーソルの場所の左側に新しい列を挿入します.
- =M-up=, =M-down=, =org-table-move-row-up=, =org-table-move-row-down= :: 
  現在の行を上/下へ移動します.
- =M-S-up=, =org-table-kill-row= :: 現在の行か水平線をキルします.
- =M-S-down=, =org-table-insert-row= :: 現在の行の上に新しい行を挿入します.
  前置引数といっしょだと, その行は現在の行の下に作られます.
- =C-c -=, =org-table-insert-hline= ::
   現在の行の下に水平線を挿入します.前置引数といっしょだと, その行は現在の行の上に作られます.
- =C-c RET=, =org-table-hline-and-move= :: 現在の行の下に水平線を挿入し, 
  その行の下の行の中にカーソルを移動します.
- =C-c ^,org-table-sort-lines= :: 
  リージョンの中の表の行をソートします. ポイントの場所がソートに対して使われる列を示し, 行の範囲は, 一番近い水平分割行の間の範囲です.
  ポイントが最初の列の前にあれば, ソートする列を求めてプロンプトが出ます.
  アクティブなリージョンがあれば, マークが最初の行とソートする列を指定し, 
  一方でポイントは, ソートに含められる最後の行の中にあるべきです.
  このコマンドは, ソートの種類を求めて(アルファベット順, 数値順, 時間順)プロンプトを出します.
  前置引数といっしょに呼ばれる時には, 
  アルファベット順のソートは大文字と小文字を区別します.


*** NEXT アジェンダの中のコマンド一覧
:PROPERTIES:
:ID:       54d54a68-8da1-4291-8147-65b6e2ce0a3a
:END:
:CLOCK:
CLOCK: [2013-03-22 金 14:06]--[2013-03-22 金 14:37] =>  0:31
:END:
:PROPERTIES:
:ID:       f920b5a9-48a5-4b6b-9ea7-8749244e30b9
:END:
**** Org の iCal エクスポートの設定
:PROPERTIES:
:ID:       4026dd6a-c7f5-4f20-8f1b-d579d0dee275
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2013-06-10 月 16:47]
:END:
:CLOCK:
CLOCK: [2013-06-10 月 14:53]--[2013-06-10 月 16:37] =>  1:44
:END:

#+NAME: ical-export-setting
#+CAPTION: iCal エクスポートの設定
#+BEGIN_SRC emacs-lisp :eval no-export
  ;; iCal の説明文
  (setq org-icalendar-combined-description "OrgMode のスケジュール出力")
  (setq org-export-exclude-tags "noexport")
  (setq org-export-with-tasks 'todo)
  ;; DONE になった TODO は出力対象から除外する
  (setq org-icalendar-include-todo t)
  (setq org-icalendar-include-body 100) ;; 本体に出す文字の制限
  (setq org-icalendar-use-scheduled '(event-if-todo))
  (setq org-icalendar-use-deadline '(event-if-todo))
  ;;  (setq org-icalendar-use-deadline '(event-if-todo event-if-not-todo todo-due))
  (setq org-icalendar-store-UID t)
  (setq org-icalendar-combined-agenda-file "~/Dropbox/Calendars/Org.ics") ;; 全部まとめて一つのファイルへ出力
#+END_SRC

**** Org mode のソースの \LaTeX エクスポートで tcolorbox を使う
:PROPERTIES:
:LOCATION: Office
:Added: [2016-08-26 Fri 09:07]
:ID:       31e825dd-85d3-4eff-a775-950a0037fe77
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-08-26 Fri 17:38]
:END:
:CLOCK:
CLOCK: [2016-08-26 Fri 15:44]--[2016-08-26 Fri 17:38] =>  1:54
CLOCK: [2016-08-26 Fri 11:36]--[2016-08-26 Fri 12:36] =>  1:00
:END:

org-latex-custom-lang-environments をカスタマイズするよ良さそうです.

**** Org mode の \LaTeX エクスポートで, シェルの出力をを tcolorbox で出力するようにする
:PROPERTIES:
:ID:       9019c889-eadf-4722-9bb6-161f99980bbb
:END:
:LOGBOOK:
- State "DONE"       from "NEXT"       [2016-08-29 Mon 13:12]
:END:
:CLOCK:
CLOCK: [2016-08-29 Mon 11:49]--[2016-08-29 Mon 12:31] =>  0:42
CLOCK: [2016-08-29 Mon 11:44]--[2016-08-29 Mon 11:49] =>  0:05
:END:
#+INDEX: tcolorbox

シェル出力をかっこうよくします.

Org mode のヘッダーで, このような tcblisting 環境を定義しておきます.

#+NAME: shelloutput-env 
#+CAPTION: Org-mode での設定
#+BEGIN_SRC org
  ,#+LATEX_HEADER: \newtcblisting{shelloutput}{colback=black,colupper=white,colframe=yellow!75!black,
  ,#+LATEX_HEADER:     title=シェル出力,
  ,#+LATEX_HEADER:     fonttitle=\bfseries,
  ,#+LATEX_HEADER:     listing only,
  ,#+LATEX_HEADER:     listing engine=minted,breakable,
  ,#+LATEX_HEADER:     minted language=sh, minted style=monokai
  ,#+LATEX_HEADER:   }
#+END_SRC

#+NAME: source-of-babel
#+CAPTION: Babel のソース
#+BEGIN_SRC org
  ,#+CAPTION: ls の例
  ,#+BEGIN_SRC sh  :results value verbatim
  ls -al ~/tmp
#+END_SRC

このソースコードの中で C-c C-c を押すと, 以下の結果が得られます.

#+NAME: result-of-babel
#+CAPTION: 結果
#+BEGIN_SRC org
  ,#+results:
  ,#+begin_example
  合計 648
  drwxrwxr-x  5 shimano shimano   4096  8 月 25 15:04 .
  drwxr-xr-x 49 shimano shimano   4096  8 月 29 12:03 ..
  drwxrwxr-x  2 shimano shimano   4096  8 月 19 13:57 auto
  -rw-rw-r--  1 shimano shimano   4364  8 月 19 13:48 enumitem.aux
  -rw-rw-r--  1 shimano shimano 111296  8 月 19 13:48 enumitem.dvi
  -rw-rw-r--  1 shimano shimano  17588  8 月 19 13:48 enumitem.log
  -rw-rw-r--  1 shimano shimano   1948  8 月 19 13:48 enumitem.out
  -rw-rw-r--  1 shimano shimano 264924  8 月 19 13:48 enumitem.pdf
  -rw-rw-r--  1 shimano shimano 151795  8 月 19 13:48 enumitem.synctex.gz
  -rw-rw-r--  1 shimano shimano  71514  8 月 19 13:57 enumitem.tex
  drwxrwxr-x  8 shimano shimano   4096  8 月 25 15:25 pygments-main
  drwxrwxr-x  3 shimano shimano   4096  8 月 19 13:42 titlesec
  ,#+end_example
#+END_SRC

#+NAME: change-latex-env
#+CAPTION: LaTeX の環境を変更する
#+BEGIN_SRC org
  ,#+ATTR_LATEX: :environment shelloutput
  ,#+results:
  ,#+begin_example
  合計 648
  drwxrwxr-x  5 shimano shimano   4096  8 月 25 15:04 .
  drwxr-xr-x 49 shimano shimano   4096  8 月 29 12:03 ..
  drwxrwxr-x  2 shimano shimano   4096  8 月 19 13:57 auto
  -rw-rw-r--  1 shimano shimano   4364  8 月 19 13:48 enumitem.aux
  -rw-rw-r--  1 shimano shimano 111296  8 月 19 13:48 enumitem.dvi
  -rw-rw-r--  1 shimano shimano  17588  8 月 19 13:48 enumitem.log
  -rw-rw-r--  1 shimano shimano   1948  8 月 19 13:48 enumitem.out
  -rw-rw-r--  1 shimano shimano 264924  8 月 19 13:48 enumitem.pdf
  -rw-rw-r--  1 shimano shimano 151795  8 月 19 13:48 enumitem.synctex.gz
  -rw-rw-r--  1 shimano shimano  71514  8 月 19 13:57 enumitem.tex
  drwxrwxr-x  8 shimano shimano   4096  8 月 25 15:25 pygments-main
  drwxrwxr-x  3 shimano shimano   4096  8 月 19 13:42 titlesec
  ,#+end_example
#+END_SRC

#+NAME: example-of-ls
#+CAPTION: ls の例
#+BEGIN_SRC sh  :results value verbatim
ls -al ~/tmp
#+END_SRC

#+NAME: results-of-ls-al
#+ATTR_LATEX: :environment shelloutput
#+results:
#+begin_example
  合計 648
  drwxrwxr-x  5 shimano shimano   4096  8 月 25 15:04 .
  drwxr-xr-x 49 shimano shimano   4096  8 月 29 12:03 ..
  drwxrwxr-x  2 shimano shimano   4096  8 月 19 13:57 auto
  -rw-rw-r--  1 shimano shimano   4364  8 月 19 13:48 enumitem.aux
  -rw-rw-r--  1 shimano shimano 111296  8 月 19 13:48 enumitem.dvi
  -rw-rw-r--  1 shimano shimano  17588  8 月 19 13:48 enumitem.log
  -rw-rw-r--  1 shimano shimano   1948  8 月 19 13:48 enumitem.out
  -rw-rw-r--  1 shimano shimano 264924  8 月 19 13:48 enumitem.pdf
  -rw-rw-r--  1 shimano shimano 151795  8 月 19 13:48 enumitem.synctex.gz
  -rw-rw-r--  1 shimano shimano  71514  8 月 19 13:57 enumitem.tex
  drwxrwxr-x  8 shimano shimano   4096  8 月 25 15:25 pygments-main
  drwxrwxr-x  3 shimano shimano   4096  8 月 19 13:42 titlesec
#+end_example

